simulation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2306
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* 
The mesh is a parallelepiped, or cylinder with square base, with the bases in the
x-z plane. It corresponds to the ranges of coordinates [-base/2, base/2], 
[-length/2,length/2], [-base/2, base/2]. The mesh is graded so that it is more 
refined close to y=0.
*/

scale 1; // every size is in meters.

#include "include/meshParameters"

// Derived constants.
half_base #eval "$base / 2";
negative_half_base #eval "- $half_base";
half_length #eval "$length / 2";
negative_half_length #eval "- $half_length";
num_y_cells #eval "$num_x_cells * $length / $base";
num_z_cells #eval "$num_x_cells";

vertices
(
    ($negative_half_base $negative_half_length $negative_half_base) // 0
    ($half_base $negative_half_length $negative_half_base)          // 1
    ($half_base $half_length $negative_half_base)                   // 2
    ($negative_half_base $half_length $negative_half_base)          // 3
    ($negative_half_base $negative_half_length $half_base)          // 4
    ($half_base $negative_half_length $half_base)                   // 5
    ($half_base $half_length $half_base)                            // 6
    ($negative_half_base $half_length $half_base)                   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($num_x_cells $num_y_cells $num_z_cells) simpleGrading (1 1 1)
);

boundary
(
    // x = -base/2
    periodicLeft
    {
        type cyclic;
        neighbourPatch periodicRight; 
        faces
        (
            (0 3 4 7)
        );
    }

    // x = base/2
    periodicRight
    {
        type cyclic;
        neighbourPatch periodicLeft; 
        faces
        (
            (1 2 5 6)
        );
    }

    // z = -base/2
    periodicBottom
    {
        type cyclic;
        neighbourPatch periodicTop; 
        faces
        (
            (0 1 2 3)
        );
    }

    // z = base/2
    periodicTop
    {
        type cyclic;
        neighbourPatch periodicBottom; 
        faces
        (
            (4 5 6 7)
        );
    }

    // y = length/2
    outlet
    {
        type patch;
        faces
        (
            (2 3 6 7)
        );
    }

    // y = -length/2
    inlet
    {
        type patch;
        faces
        (
            (0 1 4 5)
        );
    }
);


// ************************************************************************* //
