simulation/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/decomposeOptions"

numberOfSubdomains  #eval "$num_x_subdomains * $num_y_subdomains * $num_z_subdomains";

method      hierarchical;

hierarchicalCoeffs
{
    n               ($num_x_subdomains $num_y_subdomains $num_z_subdomains);
    order           xyz;
}


// ************************************************************************* //
