simulation/system/fieldAverage
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

cpAverageOverIter
{
    type            fieldAverage;
    libs            (fieldFunctionObjects);
    writeControl    writeTime;

    fields
    (
        cp
        {
            mean        on;
            prime2Mean  on;
            base        iteration;
        }
    );

    restartOnRestart    false;
    restartOnOutput     false;
    periodicRestart     true;
    restartPeriod       5;
}



// ************************************************************************* //
