simulation/system/include/decomposeOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Number of subdomains in the x (base) direction.
num_x_subdomains 4;

// Number of subdomains in the y (height) direction.
num_y_subdomains 1;

// Number of subdomains in the z (base) direction.
num_z_subdomains 2;

// ************************************************************************* //